In [77]:
import pandas as pd
import numpy as np

In [78]:
dict1 = {'Name':['Lina','Inun','Cahaya','Noni','Aida','Astri','Srize'], 'Nilai':[98,np.nan,99,87,np.nan,83,99], 'Gender':['Male','Female','Male','Male','Female','Female','Male'], 'Email': ['lina@gmail.com','Inun@gmail.com','cahaya@gmail.com','noni@yahoo.com','aida@yahoo.com','astri@yahoo.com','srize@yahoo.com']}
df1 = pd.DataFrame(dict1)
df1

     Name  Nilai  Gender             Email
0    Lina   98.0    Male    lina@gmail.com
1    Inun    NaN  Female    Inun@gmail.com
2  Cahaya   99.0    Male  cahaya@gmail.com
3    Noni   87.0    Male    noni@yahoo.com
4    Aida    NaN  Female    aida@yahoo.com
5   Astri   83.0  Female   astri@yahoo.com
6   Srize   99.0    Male   srize@yahoo.com

In [79]:
df1.head(3)

     Name  Nilai  Gender             Email
0    Lina   98.0    Male    lina@gmail.com
1    Inun    NaN  Female    Inun@gmail.com
2  Cahaya   99.0    Male  cahaya@gmail.com

In [80]:
df1.tail()

     Name  Nilai  Gender             Email
2  Cahaya   99.0    Male  cahaya@gmail.com
3    Noni   87.0    Male    noni@yahoo.com
4    Aida    NaN  Female    aida@yahoo.com
5   Astri   83.0  Female   astri@yahoo.com
6   Srize   99.0    Male   srize@yahoo.com

In [81]:
df1.head(-2)

     Name  Nilai  Gender             Email
0    Lina   98.0    Male    lina@gmail.com
1    Inun    NaN  Female    Inun@gmail.com
2  Cahaya   99.0    Male  cahaya@gmail.com
3    Noni   87.0    Male    noni@yahoo.com
4    Aida    NaN  Female    aida@yahoo.com

In [82]:
df1.tail(-3)

    Name  Nilai  Gender            Email
3   Noni   87.0    Male   noni@yahoo.com
4   Aida    NaN  Female   aida@yahoo.com
5  Astri   83.0  Female  astri@yahoo.com
6  Srize   99.0    Male  srize@yahoo.com

In [83]:
df1.shape

(7, 4)

In [84]:
print("Number of Rows",df1.shape[0])
print("Number of Columns",df1.shape[1])

Number of Rows 7
Number of Columns 4

In [85]:
df1['Nilai'].shape

(7,)

In [86]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Nilai   5 non-null      float64
 2   Gender  7 non-null      object
 3   Email   7 non-null      object
dtypes: float64(1), object(3)
memory usage: 352.0+ bytes

In [87]:
df1.isnull().sum()

Name      0
Nilai     2
Gender    0
Email     0
dtype: int64

In [88]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Nilai   5 non-null      float64
 2   Gender  7 non-null      object
 3   Email   7 non-null      object
dtypes: float64(1), object(3)
memory usage: 352.0+ bytes

In [89]:
df1.describe(include='all')

        Name      Nilai Gender           Email
count      7   5.000000      7               7
unique     7        NaN      2               7
top     Lina        NaN   Male  lina@gmail.com
freq       1        NaN      4               1
mean     NaN  93.200000    NaN             NaN
std      NaN   7.628892    NaN             NaN
min      NaN  83.000000    NaN             NaN
25%      NaN  87.000000    NaN             NaN
50%      NaN  98.000000    NaN             NaN
75%      NaN  99.000000    NaN             NaN
max      NaN  99.000000    NaN             NaN

In [90]:
df1.columns

Index(['Name', 'Nilai', 'Gender', 'Email'], dtype='object')

In [91]:
df1['Nilai'].unique()

array([98., nan, 99., 87., 83.])

In [92]:
df1['Gender'].nunique()

2

In [93]:
df1.nunique()

Name      7
Nilai     4
Gender    2
Email     7
dtype: int64

In [94]:
df1['Gender'].value_counts()

Male      4
Female    3
Name: Gender, dtype: int64

In [95]:
df1.dropna(how='all')

     Name  Nilai  Gender             Email
0    Lina   98.0    Male    lina@gmail.com
1    Inun    NaN  Female    Inun@gmail.com
2  Cahaya   99.0    Male  cahaya@gmail.com
3    Noni   87.0    Male    noni@yahoo.com
4    Aida    NaN  Female    aida@yahoo.com
5   Astri   83.0  Female   astri@yahoo.com
6   Srize   99.0    Male   srize@yahoo.com

In [96]:
df1.fillna(0)

     Name  Nilai  Gender             Email
0    Lina   98.0    Male    lina@gmail.com
1    Inun    0.0  Female    Inun@gmail.com
2  Cahaya   99.0    Male  cahaya@gmail.com
3    Noni   87.0    Male    noni@yahoo.com
4    Aida    0.0  Female    aida@yahoo.com
5   Astri   83.0  Female   astri@yahoo.com
6   Srize   99.0    Male   srize@yahoo.com

In [97]:
df1['Nilai'] = df1['Nilai'].fillna(df1['Nilai'].mean())

In [98]:
df1

     Name  Nilai  Gender             Email
0    Lina   98.0    Male    lina@gmail.com
1    Inun   93.2  Female    Inun@gmail.com
2  Cahaya   99.0    Male  cahaya@gmail.com
3    Noni   87.0    Male    noni@yahoo.com
4    Aida   93.2  Female    aida@yahoo.com
5   Astri   83.0  Female   astri@yahoo.com
6   Srize   99.0    Male   srize@yahoo.com

In [99]:
(df1['Nilai']>=80) & (df1['Nilai']<=90)

0    False
1    False
2    False
3     True
4    False
5     True
6    False
Name: Nilai, dtype: bool

In [100]:
df1['Nilai'].between(80,90)

0    False
1    False
2    False
3     True
4    False
5     True
6    False
Name: Nilai, dtype: bool

In [101]:
df1.columns

Index(['Name', 'Nilai', 'Gender', 'Email'], dtype='object')

In [102]:
df1[df1['Nilai'].min() == df1['Nilai']]

    Name  Nilai  Gender            Email
5  Astri   83.0  Female  astri@yahoo.com

In [103]:
df1[df1['Nilai'].min() == df1['Nilai']]['Name']

5    Astri
Name: Name, dtype: object

In [104]:
df1.nlargest(5,'Nilai')

     Name  Nilai  Gender             Email
2  Cahaya   99.0    Male  cahaya@gmail.com
6   Srize   99.0    Male   srize@yahoo.com
0    Lina   98.0    Male    lina@gmail.com
1    Inun   93.2  Female    Inun@gmail.com
4    Aida   93.2  Female    aida@yahoo.com

In [105]:
df1.nlargest(5,'Nilai')['Name']

2    Cahaya
6     Srize
0      Lina
1      Inun
4      Aida
Name: Name, dtype: object

In [106]:
df1.nlargest(5,'Nilai')[['Name','Nilai']]

     Name  Nilai
2  Cahaya   99.0
6   Srize   99.0
0    Lina   98.0
1    Inun   93.2
4    Aida   93.2

In [107]:
df1.sort_values(by='Nilai',ascending=False).head()[['Name','Nilai']]

     Name  Nilai
2  Cahaya   99.0
6   Srize   99.0
0    Lina   98.0
1    Inun   93.2
4    Aida   93.2

In [108]:
df1['Nilai'].mean()

93.2

In [109]:
def marks(x):
    return x/2

In [110]:
df1['Half Nilai'] = df1['Nilai'].apply(marks)

In [111]:
df1

     Name  Nilai  Gender             Email  Half Nilai
0    Lina   98.0    Male    lina@gmail.com        49.0
1    Inun   93.2  Female    Inun@gmail.com        46.6
2  Cahaya   99.0    Male  cahaya@gmail.com        49.5
3    Noni   87.0    Male    noni@yahoo.com        43.5
4    Aida   93.2  Female    aida@yahoo.com        46.6
5   Astri   83.0  Female   astri@yahoo.com        41.5
6   Srize   99.0    Male   srize@yahoo.com        49.5

In [112]:
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})

In [113]:
df1

     Name  Nilai  Gender             Email  Half Nilai  Male_Female
0    Lina   98.0    Male    lina@gmail.com        49.0            1
1    Inun   93.2  Female    Inun@gmail.com        46.6            0
2  Cahaya   99.0    Male  cahaya@gmail.com        49.5            1
3    Noni   87.0    Male    noni@yahoo.com        43.5            1
4    Aida   93.2  Female    aida@yahoo.com        46.6            0
5   Astri   83.0  Female   astri@yahoo.com        41.5            0
6   Srize   99.0    Male   srize@yahoo.com        49.5            1

In [114]:
df1.drop('Male_Female',axis=1)

     Name  Nilai  Gender             Email  Half Nilai
0    Lina   98.0    Male    lina@gmail.com        49.0
1    Inun   93.2  Female    Inun@gmail.com        46.6
2  Cahaya   99.0    Male  cahaya@gmail.com        49.5
3    Noni   87.0    Male    noni@yahoo.com        43.5
4    Aida   93.2  Female    aida@yahoo.com        46.6
5   Astri   83.0  Female   astri@yahoo.com        41.5
6   Srize   99.0    Male   srize@yahoo.com        49.5

In [115]:
df1.sort_values(by='Nilai',ascending=False)

     Name  Nilai  Gender             Email  Half Nilai  Male_Female
2  Cahaya   99.0    Male  cahaya@gmail.com        49.5            1
6   Srize   99.0    Male   srize@yahoo.com        49.5            1
0    Lina   98.0    Male    lina@gmail.com        49.0            1
1    Inun   93.2  Female    Inun@gmail.com        46.6            0
4    Aida   93.2  Female    aida@yahoo.com        46.6            0
3    Noni   87.0    Male    noni@yahoo.com        43.5            1
5   Astri   83.0  Female   astri@yahoo.com        41.5            0

In [116]:
df1[df1['Gender']=='Female'][['Name','Nilai']]

    Name  Nilai
1   Inun   93.2
4   Aida   93.2
5  Astri   83.0

In [117]:
df1[df1['Gender'].isin(['Female'])][['Name','Nilai']]

    Name  Nilai
1   Inun   93.2
4   Aida   93.2
5  Astri   83.0

In [118]:
df1.rename(columns={'Nilai':'Final Nilai'})

     Name  Final Nilai  Gender             Email  Half Nilai  Male_Female
0    Lina         98.0    Male    lina@gmail.com        49.0            1
1    Inun         93.2  Female    Inun@gmail.com        46.6            0
2  Cahaya         99.0    Male  cahaya@gmail.com        49.5            1
3    Noni         87.0    Male    noni@yahoo.com        43.5            1
4    Aida         93.2  Female    aida@yahoo.com        46.6            0
5   Astri         83.0  Female   astri@yahoo.com        41.5            0
6   Srize         99.0    Male   srize@yahoo.com        49.5            1

In [119]:
dict1 = {'Name':['Lina','Inun','Cahaya','Noni','Aida','Astri','Srize'], 'Nilai':[98,np.nan,99,87,np.nan,83,99], 'Gender':['Male','Female','Male','Male','Female','Female','Male'], 'Email': ['lina@gmail.com','Inun@gmail.com','cahaya@gmail.com','noni@yahoo.com','aida@yahoo.com','astri@yahoo.com','srize@yahoo.com']}
df1 = pd.DataFrame(dict1)
df1

     Name  Nilai  Gender             Email
0    Lina   98.0    Male    lina@gmail.com
1    Inun    NaN  Female    Inun@gmail.com
2  Cahaya   99.0    Male  cahaya@gmail.com
3    Noni   87.0    Male    noni@yahoo.com
4    Aida    NaN  Female    aida@yahoo.com
5   Astri   83.0  Female   astri@yahoo.com
6   Srize   99.0    Male   srize@yahoo.com

In [120]:
df2 = pd.DataFrame({'Name':'Anil','Nilai':90,'Gender':'Male','Email':'anil@gmail.com'},index=[0])

In [121]:
df3 = pd.concat([df1,df2],ignore_index=True)

In [122]:
df3

     Name  Nilai  Gender             Email
0    Lina   98.0    Male    lina@gmail.com
1    Inun    NaN  Female    Inun@gmail.com
2  Cahaya   99.0    Male  cahaya@gmail.com
3    Noni   87.0    Male    noni@yahoo.com
4    Aida    NaN  Female    aida@yahoo.com
5   Astri   83.0  Female   astri@yahoo.com
6   Srize   99.0    Male   srize@yahoo.com
7    Anil   90.0    Male    anil@gmail.com

In [123]:
df1.loc[:,'Nilai':'Gender']

   Nilai  Gender
0   98.0    Male
1    NaN  Female
2   99.0    Male
3   87.0    Male
4    NaN  Female
5   83.0  Female
6   99.0    Male

In [124]:
df1.iloc[1,2]

'Female'

In [125]:
df1.iloc[:,2]

0      Male
1    Female
2      Male
3      Male
4    Female
5    Female
6      Male
Name: Gender, dtype: object

In [126]:
df1['Name_Nilai'] = df1['Name'] + ','+ df1['Nilai'].apply(str)

In [127]:
df1

     Name  Nilai  Gender             Email   Name_Nilai
0    Lina   98.0    Male    lina@gmail.com    Lina,98.0
1    Inun    NaN  Female    Inun@gmail.com     Inun,nan
2  Cahaya   99.0    Male  cahaya@gmail.com  Cahaya,99.0
3    Noni   87.0    Male    noni@yahoo.com    Noni,87.0
4    Aida    NaN  Female    aida@yahoo.com     Aida,nan
5   Astri   83.0  Female   astri@yahoo.com   Astri,83.0
6   Srize   99.0    Male   srize@yahoo.com   Srize,99.0

In [128]:
df1.groupby('Gender')['Nilai'].mean().sort_values().to_frame()

        Nilai
Gender
Female  83.00
Male    95.75

In [129]:
list1=[]
for email in df1['Email']:
    list1.append(email.split('@')[1])

In [65]:
#df1['Email'][0].split('@')[1]

'gmail.com'

In [130]:
list1

['gmail.com',
 'gmail.com',
 'gmail.com',
 'yahoo.com',
 'yahoo.com',
 'yahoo.com',
 'yahoo.com']

In [131]:
df1['temp']=list1

In [132]:
df1

     Name  Nilai  Gender             Email   Name_Nilai       temp
0    Lina   98.0    Male    lina@gmail.com    Lina,98.0  gmail.com
1    Inun    NaN  Female    Inun@gmail.com     Inun,nan  gmail.com
2  Cahaya   99.0    Male  cahaya@gmail.com  Cahaya,99.0  gmail.com
3    Noni   87.0    Male    noni@yahoo.com    Noni,87.0  yahoo.com
4    Aida    NaN  Female    aida@yahoo.com     Aida,nan  yahoo.com
5   Astri   83.0  Female   astri@yahoo.com   Astri,83.0  yahoo.com
6   Srize   99.0    Male   srize@yahoo.com   Srize,99.0  yahoo.com

In [133]:
df1['temp'].value_counts()

yahoo.com    4
gmail.com    3
Name: temp, dtype: int64

In [134]:
df1['Email'].apply(lambda x:x.split('@')[1]).value_counts().head()

yahoo.com    4
gmail.com    3
Name: Email, dtype: int64